<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"f0745557a83b87a729a07f42e2822341e4cdc1d5d09df35784b42ea1babb254b","plan_job_ref":"Job Run Terraform plan in staging #247 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14845479399","plan_out_hash":"2ff8c9f86e4ad9e4a49393dc215765c9919904c1b73331e71f0b05c8237cc42c","plan_hash":"4eeacf46bd6b9e4e241e68cb6deded81bf4d9aaf0f89829b6a5cfa1fa530d859","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 19 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # cloudfoundry_app.app will be created
+   resource "cloudfoundry_app" "app" {
+       buildpacks                  = [
+           "ruby_buildpack",
        ]
+       created_at                  = (known after apply)
+       disk_quota                  = (known after apply)
+       enable_ssh                  = (known after apply)
+       environment                 = {
+           "RAILS_ENV"                = "staging"
+           "RAILS_LOG_TO_STDOUT"      = "true"
+           "RAILS_MASTER_KEY"         = (sensitive value)
+           "RAILS_SERVE_STATIC_FILES" = "true"
+           "SAML_PROXY_HOST"          = "saml-proxy-staging.app.cloud.gov"
+           "no_proxy"                 = "apps.internal,s3-fips.us-gov-west-1.amazonaws.com"
        }
+       health_check_type           = (known after apply)
+       id                          = (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
+       name                        = "continuous_monitoring-staging"
+       org_name                    = "gsa-tts-devtools-prototyping"
+       path                        = "./dist/src.zip"
+       processes                   = [
+           {
+               command                     = "./bin/rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server"
+               disk_quota                  = (known after apply)
+               health_check_http_endpoint  = "/up"
+               health_check_type           = "http"
+               instances                   = 1
+               log_rate_limit_per_second   = (known after apply)
+               memory                      = "256M"
+               readiness_health_check_type = (known after apply)
+               type                        = "web"
            },
        ]
+       readiness_health_check_type = (known after apply)
+       routes                      = (known after apply)
+       service_bindings            = [
+           {
+               service_instance = "continuous_monitoring-rds-staging"
            },
+           {
+               service_instance = "egress-proxy-staging-credentials"
            },
        ]
+       source_code_hash            = "giQfYOYmponpygfkpmp9RvnYY5/G7Hl1LC+9o4F5Z9w="
+       space_name                  = "capoc-stage"
+       stack                       = (known after apply)
+       strategy                    = "rolling"
+       updated_at                  = (known after apply)
    }

  # cloudfoundry_network_policy.egress_routing will be created
+   resource "cloudfoundry_network_policy" "egress_routing" {
+       policies = [
+           {
+               destination_app = (known after apply)
+               port            = "61443"
+               protocol        = "tcp"
+               source_app      = (known after apply)
            },
+           {
+               destination_app = (known after apply)
+               port            = "8080"
+               protocol        = "tcp"
+               source_app      = (known after apply)
            },
        ]
    }

  # cloudfoundry_service_instance.egress_proxy_credentials will be created
+   resource "cloudfoundry_service_instance" "egress_proxy_credentials" {
+       created_at        = (known after apply)
+       credentials       = (sensitive value)
+       dashboard_url     = (known after apply)
+       id                = (known after apply)
+       last_operation    = (known after apply)
+       maintenance_info  = (known after apply)
+       name              = "egress-proxy-staging-credentials"
+       space             = (known after apply)
+       type              = "user-provided"
+       updated_at        = (known after apply)
+       upgrade_available = (known after apply)
    }

  # module.app_route[0].data.cloudfoundry_domain.domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "domain" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "app.cloud.gov"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.app_route[0].data.cloudfoundry_org.org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-devtools-prototyping"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.app_route[0].data.cloudfoundry_space.space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "capoc-stage"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.app_route[0].cloudfoundry_route.app_route will be created
+   resource "cloudfoundry_route" "app_route" {
+       created_at   = (known after apply)
+       destinations = [
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
+       domain       = (known after apply)
+       host         = "continuous_monitoring-staging"
+       id           = (known after apply)
+       protocol     = (known after apply)
+       space        = (known after apply)
+       updated_at   = (known after apply)
+       url          = (known after apply)
    }

  # module.app_space.cloudfoundry_security_group_space_bindings.security_group_bindings["trusted_local_networks_egress"] will be created
+   resource "cloudfoundry_security_group_space_bindings" "security_group_bindings" {
+       running_spaces = [
+           (known after apply),
        ]
+       security_group = "71d5aa70-fdce-46fa-8494-aabdb8cae381"
    }

  # module.app_space.cloudfoundry_space.space will be created
+   resource "cloudfoundry_space" "space" {
+       allow_ssh  = true
+       created_at = (known after apply)
+       id         = (known after apply)
+       name       = "capoc-stage"
+       org        = "f0a46189-6f64-43fb-99c3-0719cf9ee255"
+       quota      = (known after apply)
+       updated_at = (known after apply)
    }

  # module.app_space.cloudfoundry_space_role.developers["a6885c8a-c011-4d34-b988-abc8033d138f"] will be created
+   resource "cloudfoundry_space_role" "developers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_developer"
+       updated_at = (known after apply)
+       user       = "a2bdf7b9-f2a4-44d3-8aae-b510eabbd5e5"
    }

  # module.app_space.cloudfoundry_space_role.developers["ryan.ahearn@gsa.gov"] will be created
+   resource "cloudfoundry_space_role" "developers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_developer"
+       updated_at = (known after apply)
+       user       = "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b"
    }

  # module.app_space.cloudfoundry_space_role.managers["a6885c8a-c011-4d34-b988-abc8033d138f"] will be created
+   resource "cloudfoundry_space_role" "managers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_manager"
+       updated_at = (known after apply)
+       user       = "a2bdf7b9-f2a4-44d3-8aae-b510eabbd5e5"
    }

  # module.database.data.cloudfoundry_service_plans.rds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "rds" {
+       name                  = "micro-psql"
+       service_offering_name = "aws-rds"
+       service_plans         = (known after apply)
    }

  # module.database.cloudfoundry_service_instance.rds will be created
+   resource "cloudfoundry_service_instance" "rds" {
+       created_at        = (known after apply)
+       dashboard_url     = (known after apply)
+       id                = (known after apply)
+       last_operation    = (known after apply)
+       maintenance_info  = (known after apply)
+       name              = "continuous_monitoring-rds-staging"
+       service_plan      = (known after apply)
+       space             = (known after apply)
+       tags              = [
+           "terraform-cloudgov-managed",
        ]
+       type              = "managed"
+       updated_at        = (known after apply)
+       upgrade_available = (known after apply)
    }

  # module.egress_proxy.data.cloudfoundry_domain.internal_domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal_domain" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.egress_proxy.data.external.proxyzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "proxyzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-proxy.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy"
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be created
+   resource "cloudfoundry_app" "egress_app" {
+       buildpacks                  = [
+           "binary_buildpack",
        ]
+       command                     = "./caddy run --config Caddyfile"
+       created_at                  = (known after apply)
+       disk_quota                  = (known after apply)
+       enable_ssh                  = (known after apply)
+       environment                 = {
+           "PROXY_ALLOW"    = <<-EOT
                raw.githubusercontent.com
            EOT
+           "PROXY_DENY"     = ""
+           "PROXY_PASSWORD" = (sensitive value)
+           "PROXY_PORTS"    = "443"
+           "PROXY_USERNAME" = (known after apply)
        }
+       health_check_type           = (known after apply)
+       id                          = (known after apply)
+       instances                   = 2
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = "64M"
+       name                        = "egress-proxy-staging"
+       org_name                    = "gsa-tts-devtools-prototyping"
+       path                        = (known after apply)
+       readiness_health_check_type = (known after apply)
+       routes                      = (known after apply)
+       source_code_hash            = (known after apply)
+       space_name                  = "capoc-stage-egress"
+       stack                       = (known after apply)
+       strategy                    = "rolling"
+       updated_at                  = (known after apply)
    }

  # module.egress_proxy.cloudfoundry_route.egress_route will be created
+   resource "cloudfoundry_route" "egress_route" {
+       created_at   = (known after apply)
+       destinations = [
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
+       domain       = (known after apply)
+       host         = "ts-devtools-prototyping-capoc-stage-egress-egress-proxy-staging"
+       id           = (known after apply)
+       protocol     = (known after apply)
+       space        = (known after apply)
+       updated_at   = (known after apply)
+       url          = (known after apply)
    }

  # module.egress_proxy.random_password.password will be created
+   resource "random_password" "password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # module.egress_proxy.random_uuid.username will be created
+   resource "random_uuid" "username" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.egress_space.cloudfoundry_security_group_space_bindings.security_group_bindings["public_networks_egress"] will be created
+   resource "cloudfoundry_security_group_space_bindings" "security_group_bindings" {
+       running_spaces = [
+           (known after apply),
        ]
+       security_group = "c70d6061-4da3-4cbb-bd8e-c9982a5e8b22"
    }

  # module.egress_space.cloudfoundry_space.space will be created
+   resource "cloudfoundry_space" "space" {
+       allow_ssh  = true
+       created_at = (known after apply)
+       id         = (known after apply)
+       name       = "capoc-stage-egress"
+       org        = "f0a46189-6f64-43fb-99c3-0719cf9ee255"
+       quota      = (known after apply)
+       updated_at = (known after apply)
    }

  # module.egress_space.cloudfoundry_space_role.developers["a6885c8a-c011-4d34-b988-abc8033d138f"] will be created
+   resource "cloudfoundry_space_role" "developers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_developer"
+       updated_at = (known after apply)
+       user       = "a2bdf7b9-f2a4-44d3-8aae-b510eabbd5e5"
    }

  # module.egress_space.cloudfoundry_space_role.developers["ryan.ahearn@gsa.gov"] will be created
+   resource "cloudfoundry_space_role" "developers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_developer"
+       updated_at = (known after apply)
+       user       = "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b"
    }

  # module.egress_space.cloudfoundry_space_role.managers["a6885c8a-c011-4d34-b988-abc8033d138f"] will be created
+   resource "cloudfoundry_space_role" "managers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_manager"
+       updated_at = (known after apply)
+       user       = "a2bdf7b9-f2a4-44d3-8aae-b510eabbd5e5"
    }

Plan: 19 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #247](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14845479399)